import { FoodQAItem } from '~app/knowledge/domain/referenceModels';

// 副食品常見問答
export const foodQA: FoodQAItem[] = [
  {
    question: '什麼時候開始給副食品？',
    answer:
      '除非厭奶嚴重經醫師指示，否則皆應從4個月大開始給予副食品。打預防針後或正在換奶時，應避免測試新食材',
  },
  {
    question: '餵食方式與順序？',
    answer:
      '必須使用「湯匙」餵食以訓練吞嚥，絕對不能用奶瓶餵米湯或米糊。母奶寶寶可先喝奶再吃副食，或在兩餐奶中間給予，重點是選在寶寶精神好且「不會太餓」的時候餵',
  },
  {
    question: '吃不完的副食品可以留到下一餐嗎？',
    answer:
      '沾過口水的副食品不可留到下一餐；若加熱到一半寶寶睡著，放保溫電鍋超過1小時就應倒掉，以免變質',
  },
  {
    question: '需要額外喝水嗎？',
    answer: '吃副食後應觀察便便，若無硬便不喝水也無妨；開始吃副食就要記錄排便次數',
  },
  {
    question: '便便變得很奇怪是正常的嗎？',
    answer:
      '吃副食後便便次數增加1-2次且呈糊泥狀屬正常腸胃適應；若一天排出「水便」超過6次，且伴隨排氣水聲，則可能是腸胃'
      + '型病毒感染，需帶尿布就醫。紅蘿蔔、金針菇等富含纖維的食材，隔天隨便便原封不動排出是正常的',
  },
  {
    question: '豆腐如何保存？',
    answer:
      '傳統豆腐含鈣量高於盒裝豆腐。買回家後需泡在開水中並放入冰箱冷藏，每天必須換水，最好5天內吃完以免變酸腐壞',
  },
];
